### Binning dengan linspace

In [1]:
import pandas as pd
import numpy as np
from sklearn.pipeline import Pipeline

In [2]:
df = pd.read_csv('datasetgaji.csv')
df.head(6)

             Nama Status Rumah  Gaji Orang Tua  Keterangan
0      aldi taher      Kontrak         2100000         NaN
1          kekeyi        Milik         4000000         NaN
2   rangga sasana      Kontrak         1400000         NaN
3  vicky prasetyo      Kontrak          700000         NaN
4            Zuko        Milik          650000         NaN
5           dyrga      Kontrak          450000         NaN

In [3]:
bins = np.linspace(min(df['Gaji Orang Tua']), max(df['Gaji Orang Tua']),3)
bins
# mengatur pengelompokan data secara otomatis

array([ 450000., 2225000., 4000000.])

In [4]:
kategori = ['Kecil','Besar']

In [5]:
df['gaji_binned'] = pd.cut(df['Gaji Orang Tua'], bins=bins, labels=kategori, include_lowest=True)
df

             Nama Status Rumah  Gaji Orang Tua  Keterangan gaji_binned
0      aldi taher      Kontrak         2100000         NaN       Kecil
1          kekeyi        Milik         4000000         NaN       Besar
2   rangga sasana      Kontrak         1400000         NaN       Kecil
3  vicky prasetyo      Kontrak          700000         NaN       Kecil
4            Zuko        Milik          650000         NaN       Kecil
5           dyrga      Kontrak          450000         NaN       Kecil